# Дан текстовий файл f. Записати в файл g зі збереженням порядку проходження ті символи файлу f, яким в цьому файлі
# передує перше поєднання 'qwe'.
# Гевчук Максим КН-А

with open("f.txt", mode="r") as file_f:
    with open("g.txt", mode="w") as file_g:

        # читає всі дані в список
        text = file_f.readlines()
        word = "qwe"
        # лічильник рядків
        i = 0
        # перебираються рядки в тексті
        for line in text:
            # коли "qwe" знайдеться в деякому рядку
            if word in line:
                # то відрізаються попередні рядки в тексті
                text = text[i::]
                # та попередні символи в рядку
                text[0] = text[0][text[0].find(word) + 3::]
                break
            i += 1
        # дані, які лишились, записуються в файл g
        file_g.write(''.join(text))
